### Method a url argument

In [1]:
import pandas as pd

In [3]:
URL = "https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv"
baby_names = pd.read_csv(URL)
baby_names.head(3)

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42

In [4]:
baby_names.count()

Year of Birth         30108
Gender                30108
Ethnicity             30108
Child's First Name    30108
Count                 30108
Rank                  30108
dtype: int64

### Object Conversion

In [14]:
baby_names["Child's First Name"].head(3).tolist() #conversion from Series to list

['GERALDINE', 'GIA', 'GIANNA']

In [13]:
baby_names["Child's First Name"].to_frame().head()

  Child's First Name
0          GERALDINE
1                GIA
2             GIANNA
3            GISELLE
4              GRACE

In [18]:
",".join(str(name) for name in baby_names["Child\'s First Name"].head(25))

'GERALDINE,GIA,GIANNA,GISELLE,GRACE,GUADALUPE,HAILEY,HALEY,HANNAH,HAYLEE,HAYLEY,HAZEL,HEAVEN,HEIDI,HEIDY,HELEN,IMANI,INGRID,IRENE,IRIS,ISABEL,ISABELA,ISABELLA,ISABELLE,ISIS'

### Exporting CSV File with .to_csv() method

In [19]:
URL = "https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv"
baby_names = pd.read_csv(URL)
baby_names.head(3)

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42

In [24]:
baby_names.to_csv("Baby-Names.csv")

In [25]:
baby_names.to_csv("Baby-Names.csv" , index = False)

In [26]:
baby_names.to_csv("Baby-Names.csv" , index = False , columns = ["Year of Birth", "Gender" , "Child's First Name"])

### Import Excel Files

In [34]:
df = pd.read_excel("input/Data - Single Worksheet.xlsx") # have single sheet
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [35]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df = pd.read_excel("input/Data - Multiple Worksheets.xlsx") # have multiple sheets
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [37]:
type(df)

pandas.core.frame.DataFrame

In [40]:
df = pd.read_excel("input/Data - Multiple Worksheets.xlsx" , sheet_name = 0)
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [41]:
type(df)

pandas.core.frame.DataFrame

In [43]:
df = pd.read_excel("input/Data - Multiple Worksheets.xlsx" , sheet_name = [0,1])
df

OrderedDict([(0,   First Name Last Name           City Gender
              0    Brandon     James          Miami      M
              1       Sean   Hawkins         Denver      M
              2       Judy       Day    Los Angeles      F
              3     Ashley      Ruiz  San Francisco      F
              4  Stephanie     Gomez       Portland      F),
             (1,   First Name Last Name           City Gender
              0     Parker     Power        Raleigh      F
              1    Preston  Prescott   Philadelphia      F
              2    Ronaldo   Donaldo         Bangor      M
              3      Megan   Stiller  San Francisco      M
              4     Bustin    Jieber         Austin      F)])

In [44]:
type(df)

collections.OrderedDict

In [45]:
df[0]

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [46]:
df[1]

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [48]:
df = pd.read_excel("input/Data - Multiple Worksheets.xlsx" , sheet_name = ["Data 1","Data 2"])
df

OrderedDict([('Data 1',   First Name Last Name           City Gender
              0    Brandon     James          Miami      M
              1       Sean   Hawkins         Denver      M
              2       Judy       Day    Los Angeles      F
              3     Ashley      Ruiz  San Francisco      F
              4  Stephanie     Gomez       Portland      F),
             ('Data 2',   First Name Last Name           City Gender
              0     Parker     Power        Raleigh      F
              1    Preston  Prescott   Philadelphia      F
              2    Ronaldo   Donaldo         Bangor      M
              3      Megan   Stiller  San Francisco      M
              4     Bustin    Jieber         Austin      F)])

In [50]:
df["Data 1"]

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [52]:
df = pd.read_excel("input/Data - Multiple Worksheets.xlsx" , sheet_name = "Data 1")
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [54]:
df = pd.read_excel("input/Data - Multiple Worksheets.xlsx" , sheet_name = [0,"Data 2"])
df

OrderedDict([(0,   First Name Last Name           City Gender
              0    Brandon     James          Miami      M
              1       Sean   Hawkins         Denver      M
              2       Judy       Day    Los Angeles      F
              3     Ashley      Ruiz  San Francisco      F
              4  Stephanie     Gomez       Portland      F),
             ('Data 2',   First Name Last Name           City Gender
              0     Parker     Power        Raleigh      F
              1    Preston  Prescott   Philadelphia      F
              2    Ronaldo   Donaldo         Bangor      M
              3      Megan   Stiller  San Francisco      M
              4     Bustin    Jieber         Austin      F)])

In [55]:
df[0]

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [57]:
df["Data 2"]

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

### Export Excel File

In [58]:
URL = "https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv"
baby_names = pd.read_csv(URL)
baby_names.head(3)

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42

In [64]:
mask = baby_names["Gender"] == "FEMALE"
girls = baby_names[mask]
girls.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [65]:
mask = baby_names["Gender"] == "MALE"
boys = baby_names[mask]
boys.head()

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
546,2011,MALE,ASIAN AND PACIFIC ISLANDER,AARAV,15,51
547,2011,MALE,ASIAN AND PACIFIC ISLANDER,AARON,51,19
548,2011,MALE,ASIAN AND PACIFIC ISLANDER,ABDUL,20,46
549,2011,MALE,ASIAN AND PACIFIC ISLANDER,ABDULLAH,30,36
550,2011,MALE,ASIAN AND PACIFIC ISLANDER,ADAM,28,38

In [67]:
excel_file = pd.ExcelWriter("Baby_Names.xlsx") # creating the excelWriter object
excel_file

In [70]:
boys.to_excel(excel_file , sheet_name = "Boys" , index = False) # creating sheets, but no saving on xlsx file
girls.to_excel(excel_file, sheet_name= "Girls" , index = False , columns = ["Year of Birth","Child's First Name","Rank"])

In [71]:
excel_file.save() # here the file will be saved